{
  "about": {
    "title": "Hello!",
    "description": "Thank you for taking the time out of your no doubt busy day to come by my little corner of the internet. I've been leveling up my skills in front-end web development for a little over a year now. I've found the path to be rewarding, exhausting, fun, and much more. I am a creator at heart. I love to create things that are useful, and that solve small problems. I am a self taught developer, and I am always looking to learn more. I am currently working on a few projects, and I am always looking for new opportunities. If you have any questions, or would like to work together, please feel free to contact me. I look forward to hearing from you."
  },
  "projects": [
    {
      "title": "Etch-a-Sketch",
      "link": "https://fluffy-croissant-7df646.netlify.app",
      "image": "assets/Screens/EtchaSketch-screen.png",
      "alt": "Etch-a-Sketch screenshot",
      "description": "This was the first solo project I did after I decided to start taking coding seriously as a new career choice. I remember spending hours trying to solve the resizing problem of this app. Generating a two dimensional array, and applying event listeners to it was incredibly hard! Though, looking back at it now all I do is smile. It reminds me of the choice that I made, and the joy of getting the thing to work for the first time. Knowing that I was the one to do it. I included this project as a kind of touch stone. An example of where I started, and a reminder to myself to stay humble as I progress on this difficult and wonderful path."
    },
    {
      "title": "Expense Tracker",
      "link": "https://sparkly-squirrel-e6c6c1.netlify.app",
      "image": "assets/Screens/Expense-screen.png",
      "alt": "Expense Tracker screenshot",
      "description": "This one was a great stepping stone for me. When I approached this project, I had just finished a second take on the basics of html, css, and js. I was doing progressively harder projects on Frontend mentor, and wanted to do one more before I did a project in React. While it wasn't a complete walk in the park, the project came together fairly well. I didn't have any major hiccups, and the planing side of things was smooth. I did struggle a bit with a way to link the size of the bar graphs to the amount input from the given json file, but that was a refreshing kind of problem."
    },
    {
      "title": "Calculator",
      "link": "https://polite-elf-7b445f.netlify.app",
      "image": "assets/Screens/Calc-screen.png",
      "alt": "Calculator screenshot",
      "description": "I enjoyed working on this one. This was the first 'Major' React app that I built. And man was it a great challenge. I initially focused on the styling of the project for two reasons. First being that I had a full design file to work from, so getting the basic visuals into place was an easy start. Second was because one of the core components to this project was about the changeable theme. Deciding on what what components to build was a bit difficult, because I wasn't sure if I wanted to have separate components for the function buttons, or just a universal button, and have it incorporate the relevant functionality. Looking back at it, I realize that I used several method of building that I had grown used to in just pure JS. The problem with that was that now I know that they don't really fit with the way React is used. Which is Great! I've grown to understand that there are a few key elements to coding that I truly enjoy. Everything is about learning. No matter if you do it perfectly and are super efficient in building an algorithm, or have built the clunkiest app you've every seen. You've learned something. Get it going, then make it pretty. This one I like to call 'Keep it Clunky!' Because I try to not worry about making amazingly optimized code in the initial build. I know that software rot, or debt is a problem, but I like to approach the 'clean code' methodology by building small clunky parts that work first, then cleaning them up after."
    },
    {
      "title": "Portfolio",
      "link": "https://precious-tulumba-52f6c6.netlify.app",
      "image": "assets/Screens/Portfolio-screen.png",
      "alt": "Portfolio screenshot",
      "description": "This one was both fun and nerve raking! I had done a couple of projects using react, and was starting to get more comfortable with it. Then I started planing my portfolio site. I knew that I wanted to keep it simple for the first version, but of course I over reached when designing. (I'm not a designer!). After struggling with that particularly annoying dragon, I settled on a much more manageable design. But I still wanted to do something new with it. So I decided to incorporate a technology hadn't used before. Tailwind css. It was rough going at first. Getting familiar with a different way of handling css took some getting used to. But I think that I gain two valuable lessons from this project. One; I discovered how cool Tailwind is! I mean, even just starting using it made styling SO MUCH EASIER!!! Two; I need to do more projects with unknown technologies in them. It helped push me to learn so much faster than when I would spend literal days studying and working through a course. But using Tailwind on an important project helped push me, and framed the important stuff right off the bat."
    }
  ]
}
